app/Controllers/admin.php

    public function index()
    {
        $currentUser = $this->request->getVar('page_users') ? $this->request->getVar('page_users') : 1;
        $users = new \Myth\Auth\Models\UserModel();
        $carinya = $this->request->getVar('cari');
        if ($carinya) {
            $datanya = $users->search($carinya)->orderBy('created_at', 'desc'); // Urutkan berdasarkan created_at terbaru
        } else {
            $datanya = $users->orderBy('created_at', 'desc'); // Urutkan berdasarkan created_at terbaru
        }

        $data = [
            'users' => $datanya->paginate(5, 'users'),
            'pager' => $users->pager,
            'current' => $currentUser
        ];
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`