app/Controllers/thl.php

SELECT *
FROM `users`
WHERE `users`.`id` = '61'
---
    public function mulai2()
    {
        // Ambil kembali ID pengguna dari sesi.
        $user_id = session()->get('user_id');

        if ($user_id) {
            // Gunakan ID pengguna untuk mengambil data tambahan dari database.
            $users = new \Myth\Auth\Models\UserModel();
            $user = $users->find($user_id);