app/Models/lokasi.php

    public function getUsersCount()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `lok`